Code source/Bankiko/app/Controllers/Auth.php

    public function loginUser()
    {
        $model = new UtilisateurModel();
        $email = $this->request->getPost('email');  // Utilisation de l'email pour la connexion
        $password = $this->request->getPost('password');

        // Rechercher l'utilisateur par email
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `email` = 'mayah@gmail.com'
 LIMIT 1