Code source/Bankiko/app/Controllers/Client.php

    public function index()
    {
        $userId = $this->_getUserId();

        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Utilisateur non trouvé.');
        }

        $compteModel = new CompteModel();
        $compte = $compteModel->where('utilisateur_id', $userId)->first();
---
SELECT *
FROM `comptes`
WHERE `utilisateur_id` = '10'
 LIMIT 1

    public function effectuerDepot()
    {
        $montant = $this->request->getPost('montant');
        $userId = session()->get('id');

        log_message('debug', 'Montant de dépôt reçu : ' . $montant);
        log_message('debug', 'ID de l\'utilisateur connecté : ' . $userId);

        $compteModel = new CompteModel();
        $compte = $compteModel->where('utilisateur_id', $userId)->first();
        $pretModel = new PretModel();

        if (!$compte) {
            log_message('error', 'Aucun compte trouvé pour l\'utilisateur ID : ' . $userId);
            return redirect()->back()->with('error', 'Compte non trouvé. Veuillez contacter l\'administration.');
        }

        if ($montant <= 0) {
            log_message('error', 'Montant de dépôt invalide : ' . $montant);
            return redirect()->back()->with('error', 'Le montant du dépôt doit être supérieur à zéro.');
        }

        // Vérifier s'il y a un prêt actif
        $pretActif = $pretModel->where('compte_id', $compte['id'])->where('montant >', 0)->first();
---
SELECT *
FROM `comptes`
WHERE `utilisateur_id` = '9'
 LIMIT 1
SELECT *
FROM `prets`
WHERE `compte_id` = '6'
AND `montant` > 0
 LIMIT 1

            if ($montantRestant <= 0) {
                // Le prêt est complètement remboursé
                $pretActif['montant'] = 0;
                $pretModel->save($pretActif);
---
UPDATE `prets` SET `compte_id` = '6', `montant` = 0, `rembourser` = '0.00', `status` = '', `date_emprunt` = '2024-09-03 07:25:53'
WHERE `prets`.`id` IN ('17')

            } else {
                // Le prêt n'est pas complètement remboursé
                $pretActif['montant'] = $montantRestant;
                $pretModel->save($pretActif);
---
UPDATE `prets` SET `compte_id` = '6', `montant` = 500, `rembourser` = '0.00', `status` = '', `date_emprunt` = '2024-09-03 07:25:53'
WHERE `prets`.`id` IN ('17')

            $compte['solde'] += $montant;
        }

        if (!$compteModel->save($compte)) {
---
UPDATE `comptes` SET `utilisateur_id` = '9', `solde` = 150
WHERE `comptes`.`id` IN ('6')

            'date' => date('Y-m-d H:i:s')
        ];

        if (!$transactionModel->save($transactionData)) {
---
INSERT INTO `transactions` (`compte_id`, `type`, `montant`, `date`) VALUES ('6', 'depot', '500', '2024-09-03 04:36:03')

    public function demanderPret()
{
    $userId = session()->get('id');
    $pretModel = new PretModel();
    $compteModel = new CompteModel();
    $compte = $compteModel->where('utilisateur_id', $userId)->first();

    if (!$compte) {
        return redirect()->to('/client/pret')->with('error', 'Compte non trouvé. Veuillez contacter l\'administration.');
    }

    // Vérifier s'il y a un prêt actif non remboursé
    $pretActif = $pretModel->where('compte_id', $compte['id'])->where('montant >', 0)->first();

    if ($pretActif) {
        return redirect()->to('/client/pret')->with('error', 'Vous avez déjà un prêt en cours. Veuillez rembourser le prêt actuel avant d\'en demander un autre.');
    }

    $montant = $this->request->getPost('montant');

    // Vérifier si le montant est négatif ou nul
    if ($montant <= 0) {
        return redirect()->to('/client/pret')->with('error', 'Le montant du prêt doit être un nombre positif.');
    }

    // Vérifier s'il y a un prêt remboursé
    $pretRembourse = $pretModel->where('compte_id', $compte['id'])->where('montant', 0)->first();
---
SELECT *
FROM `comptes`
WHERE `utilisateur_id` = '10'
 LIMIT 1
SELECT *
FROM `prets`
WHERE `compte_id` = '7'
AND `montant` > 0
 LIMIT 1
SELECT *
FROM `prets`
WHERE `compte_id` = '7'
AND `montant` = 0
 LIMIT 1

        // Réutiliser l'entrée de prêt remboursé
        $pretRembourse['montant'] = $montant;
        $pretRembourse['date_creation'] = date('Y-m-d'); // Mise à jour de la date de création
        $pretModel->save($pretRembourse);
---
INSERT INTO `prets` (`compte_id`, `montant`) VALUES ('6', '200')
UPDATE `prets` SET `compte_id` = '7', `montant` = '5000', `rembourser` = '0.00', `status` = '', `date_emprunt` = '2024-09-03 07:50:03'
WHERE `prets`.`id` IN ('19')

    private function _getUserId()
    {
        $username = session()->get('username');
        if (!$username) {
            return null;
        }

        $utilisateurModel = new UtilisateurModel();
        $user = $utilisateurModel->where('username', $username)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `username` = 'mayah'
 LIMIT 1