Code source/Bankiko/app/Views/client/dashboard.php

                        <?php
                            // Afficher le montant restant du prêt
                            $pretModel = new \App\Models\PretModel();
                            $pretActif = $pretModel->where('compte_id', $compte['id'])->where('montant >', 0)->first();
---
SELECT *
FROM `prets`
WHERE `compte_id` = '7'
AND `montant` > 0
 LIMIT 1